// 帳號清單 (之後要增刪帳號改這裡就好)
const accountDatabase = [
    { 
        id: "a123", 
        name:"",
        roles: ["ST01", "ST04", "ST05", "NK01"],
        price: "", 
        link: "https://google.com" 
    },
    { 
        id: "NK01K10ST17", 
        name:"",
        roles: ["NK01", "NK10", "ST17"], 
        price: "", 
        link: "https://google.com" 
    },
    { 
        id: "ST12ST20", 
        name:"",
        roles: ["ST12", "ST20"],
        price: "", 
        link: "https://google.com" 
    },
];

const roleMap = {
    // 守望者小隊 (ST)
    "ST01": "伊迪絲", "ST02": "克拉奇", "ST03": "卡麗絲塔", "ST04": "哪吒", "ST05": "塔琳",
    "ST06": "奧利斯泰", "ST07": "孫悟空", "ST08": "尤糯米雅", "ST09": "康斯坦絲", "ST10": "德雷琳",
    "ST11": "極心", "ST12": "盧修斯", "ST13": "艾洛拉", "ST14": "艾爾莉絲", "ST15": "艾瑞斯",
    "ST16": "英格麗德", "ST17": "貂蟬", "ST18": "關羽", "ST19": "雅", "ST20": "雷古拉斯",

    // 詛咒神教 (CR)
    "CR01": "扎里絲", "CR02": "卡赫利安", "CR03": "弗拉德三世", "CR04": "皮埃爾", "CR05": "克莉亞",
    "CR06": "克爾柏洛斯", "CR07": "別西卜", "CR08": "杜爾伽", "CR09": "里弗船長", "CR10": "亞洛特",
    "CR11": "阿緹密斯", "CR12": "阿諾菈", "CR13": "柯羅莎", "CR14": "埃薩雷斯", "CR15": "烏瑞丁",
    "CR16": "馬爾蔚拉", "CR17": "勒席爾", "CR18": "達麗亞", "CR19": "瑪格達", "CR20": "碧雅翠絲",
    "CR21": "維爾娜", "CR22": "摩莉甘", "CR23": "澤魯斯", "CR24": "薇莉絲", "CR25": "黛米", "CR26": "羅莎莉婭",

    // 煉獄爆破 (HE)
    "HE01": "弗爾西", "HE02": "艾莉恩", "HE03": "亞洛特", "HE04": "阿納伊", "HE05": "索爾卡登絲",
    "HE06": "茲麗特", "HE07": "馬爾里克", "HE08": "萊拉", "HE09": "貂蟬", "HE10": "奧里姆",
    "HE11": "赫克斯", "HE12": "澤娜", "HE13": "諾克圖恩", "HE14": "賽特拉姆", "HE15": "邁卡",
    "HE16": "雙生魔", "HE17": "魔君菲尼亞斯",

    // 北境 (NK)
    "NK01": "北境關羽", "NK02": "北境卡西爾", "NK03": "北境卡德格里姆", "NK04": "北境布洛基爾", "NK05": "北境瓦爾基拉",
    "NK06": "北境米娜", "NK07": "北境艾爾莉絲", "NK08": "北境艾德林", "NK09": "北境克羅多爾", "NK10": "北境呂布",
    "NK11": "北境沙米爾", "NK12": "北境芬里斯", "NK13": "北境阿斯特萊", "NK14": "北境阿爾黛雅", "NK15": "北境哈爾茲王",
    "NK16": "北境埃爾德", "NK17": "北境格溫德琳", "NK18": "北境格雷休斯", "NK19": "北境莎蒂", "NK20": "北境凱恩",
    "NK21": "北境琳克絲", "NK22": "北境瑞文爾德", "NK23": "北境瑪爾蔚拉", "NK24": "北境緋爾莎", "NK25": "北境德雷琳",
    "NK26": "北境潔拉", "NK27": "北境諾克圖恩",

    // 守護者神廟 (SM)
    "SM01": "卡埃德", "SM02": "弗恩", "SM03": "瓦蕾亞", "SM04": "伊尼特", "SM05": "托爾斯克",
    "SM06": "艾洛溫", "SM07": "艾瑞斯", "SM08": "克美特", "SM09": "努美拉", "SM10": "奈理莎",
    "SM11": "居魯士", "SM12": "波瑞斯", "SM13": "阿諾菈", "SM14": "哪吒", "SM15": "埃澤恩",
    "SM16": "娜斯伽", "SM17": "馬爾里克", "SM18": "莫里登", "SM19": "萊拉", "SM20": "塔倫",
    "SM21": "達麗亞", "SM22": "達蘇彌", "SM23": "碧雅翡絲", "SM24": "維諾瑪", "SM25": "緋爾沙",
    "SM26": "赫爾加", "SM27": "賽勒涅", "SM28": "賽雷菲娜",

    // 貫星之箭 (SA)
    "SA01": "丹赫辛", "SA02": "卡利普索", "SA03": "尼克斯", "SA04": "弗恩", "SA05": "伊歐沃",
    "SA06": "米娜", "SA07": "艾洛拉", "SA08": "西拉斯", "SA09": "努美拉", "SA10": "希瑟拉",
    "SA11": "亞歷珊卓夫人", "SA12": "佩拉吉奧斯", "SA13": "阿拉夏", "SA14": "埃普薩", "SA15": "凱",
    "SA16": "塔琳", "SA17": "塔露拉", "SA18": "楊戩", "SA19": "瑞扎戈", "SA20": "赫克斯",
    "SA21": "德古拉", "SA22": "魯恩霍洛", "SA23": "優璃", "SA24": "薩迦克",

    // 不可名者 (NN)
    "NN01": "伊米萊特", "NN02": "阿賈克斯",

    // 混沌征服者 (CH)
    "CH01": "瓦爾德隆", "CH02": "格漢",

    //至高仲裁者 (HJ)
    "HJ01": "普雷特斯"
};

